; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation6 - direction
	Star9 - direction
	GroundStation10 - direction
	Star7 - direction
	Star4 - direction
	Star8 - direction
	GroundStation2 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star7)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star8)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star8)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 infrared1)
	(have_image Planet14 infrared1)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 infrared1)
	(have_image Planet17 infrared1)
	(have_image Phenomenon18 infrared1)
	(have_image Planet19 thermograph0)
))

)

; plan
1. (turn_to satellite0 star8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star8)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 planet11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet11)
   goals met: 0 of 9
5. (take_image satellite0 planet11 instrument1 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon18 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon18)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon18 instrument1 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon15 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon15 instrument1 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon12 instrument1 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 4 of 9
12. (turn_to satellite0 planet14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet14)
   goals met: 4 of 9
13. (take_image satellite0 planet14 instrument1 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 5 of 9
14. (turn_to satellite0 planet17 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet17)
   goals met: 5 of 9
15. (take_image satellite0 planet17 instrument1 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 6 of 9
16. (turn_to satellite0 planet19 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet19)
   goals met: 6 of 9
17. (take_image satellite0 planet19 instrument1 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 7 of 9
18. (turn_to satellite0 star13 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star13)
   goals met: 7 of 9
19. (take_image satellite0 star13 instrument1 infrared1)
   added: (have_image star13 infrared1)
   goals met: 8 of 9
20. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 8 of 9
21. (take_image satellite0 star16 instrument1 infrared1)
   added: (have_image star16 infrared1)
   goals met: 9 of 9
